codex-test-bridge/src/InformationRegisters/CodexUIJobs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CodexUIJobs</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ScenarioJson</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ResultJson</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Payload</Name>
					<Comment>Persistent cross-session UI command value</Comment>
					<Type><v8:Type>v8:ValueStorage</v8:Type></Type>
					<PasswordMode>false</PasswordMode><Format/><EditFormat/><ToolTip/><MarkNegatives>false</MarkNegatives><Mask/><MultiLine>false</MultiLine><ExtendedEdit>false</ExtendedEdit><MinValue xsi:nil="true"/><MaxValue xsi:nil="true"/><FillFromFillingValue>false</FillFromFillingValue><FillValue xsi:nil="true"/><FillChecking>DontCheck</FillChecking><ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems><ChoiceParameterLinks/><ChoiceParameters/><QuickChoice>Auto</QuickChoice><CreateOnInput>Auto</CreateOnInput><ChoiceForm/><LinkByType/><ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput><Indexing>DontIndex</Indexing><FullTextSearch>DontUse</FullTextSearch>				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UpdatedAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>JobId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

codex-test-bridge/src/CommonModules/CodexUIJobsServer/Ext/Module.bsl
Функция СоздатьЗадание(Идентификатор, СценарийJSON) Экспорт
	Набор = РегистрыСведений.CodexUIJobs.СоздатьНаборЗаписей();
	Набор.Отбор.JobId.Установить(Идентификатор);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
		Запись.JobId = Идентификатор;
	Иначе
		Запись = Набор[0];
	КонецЕсли;
	Запись.ScenarioJson = СценарийJSON;
	Запись.ResultJson = "";
	Запись.Status = "queued";
	Запись.Payload = Неопределено;
	Запись.UpdatedAt = ТекущаяДатаСеанса();
	// Для прогретого TestClient обновляем ту же запись, а не заменяем её
	// удалением. Иначе клиентский сеанс может продолжать видеть старую запись
	// по JobId и не получить команду следующего UI-сегмента.
	Набор.Записать();
	Возврат ПолучитьЗадание(Идентификатор);
КонецФункции

Функция ПолучитьЗадание(Идентификатор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| CodexUIJobs.ScenarioJson КАК ScenarioJson,
		| CodexUIJobs.ResultJson КАК ResultJson,
		| CodexUIJobs.Status КАК Status,
		| CodexUIJobs.UpdatedAt КАК UpdatedAt
		|ИЗ
		| РегистрСведений.CodexUIJobs КАК CodexUIJobs
		|ГДЕ
		| CodexUIJobs.JobId = &JobId";
	Запрос.УстановитьПараметр("JobId", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Новый Структура("jobId,scenario,status,result,updatedAt",
		Идентификатор, Выборка.ScenarioJson, Выборка.Status,
		Выборка.ResultJson, Выборка.UpdatedAt);
КонецФункции

Функция ПолучитьСценарий(Идентификатор) Экспорт
	Задание = ПолучитьЗадание(Идентификатор);
	Если Задание = Неопределено Тогда
		ВызватьИсключение "Codex UI job was not found: " + Идентификатор;
	КонецЕсли;
	Возврат Задание.scenario;
КонецФункции

Процедура СохранитьСценарий(Идентификатор, СценарийJSON, Статус = "queued") Экспорт
	Набор = РегистрыСведений.CodexUIJobs.СоздатьНаборЗаписей();
	Набор.Отбор.JobId.Установить(Идентификатор);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		ВызватьИсключение "Codex UI job was not found: " + Идентификатор;
	КонецЕсли;
	Набор[0].ScenarioJson = СценарийJSON;
	Набор[0].ResultJson = "";
	Набор[0].Status = Статус;
	Набор[0].UpdatedAt = ТекущаяДатаСеанса();
	Набор.Записать(Истина);
КонецПроцедуры

Процедура СохранитьРезультат(Идентификатор, РезультатJSON, Статус) Экспорт
	Набор = РегистрыСведений.CodexUIJobs.СоздатьНаборЗаписей();
	Набор.Отбор.JobId.Установить(Идентификатор);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
		Запись.JobId = Идентификатор;
		Запись.ScenarioJson = "";
	Иначе
		Запись = Набор[0];
	КонецЕсли;
	Запись.ResultJson = РезультатJSON;
	Запись.Status = Статус;
	Запись.UpdatedAt = ТекущаяДатаСеанса();
	Набор.Записать(Истина);
КонецПроцедуры

Процедура СохранитьPayload(Идентификатор, Значение) Экспорт
	Набор = РегистрыСведений.CodexUIJobs.СоздатьНаборЗаписей();
	Набор.Отбор.JobId.Установить(Идентификатор);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда ВызватьИсключение "Codex UI job was not found: " + Идентификатор; КонецЕсли;
	Набор[0].Payload = Новый ХранилищеЗначения(Значение);
	Набор.Записать(Истина);
КонецПроцедуры

Функция ПолучитьPayload(Идентификатор) Экспорт
	Набор = РегистрыСведений.CodexUIJobs.СоздатьНаборЗаписей();
	Набор.Отбор.JobId.Установить(Идентификатор);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Или Набор[0].Payload = Неопределено Тогда
		ВызватьИсключение "Codex UI job payload was not found: " + Идентификатор;
	КонецЕсли;
	Возврат Набор[0].Payload.Получить();
КонецФункции

Процедура УдалитьЗадание(Идентификатор) Экспорт
	Набор = РегистрыСведений.CodexUIJobs.СоздатьНаборЗаписей();
	Набор.Отбор.JobId.Установить(Идентификатор);
	Набор.Записать(Истина);
КонецПроцедуры

Функция НайтиПолноеИмяМетаданныхДляПоля(ИмяПоля, ИмяТаблицы, ЗаголовокПоля) Экспорт
	ИменаКандидаты = Новый Массив;
	Если Не ПустаяСтрока(ИмяПоля) Тогда
		ИменаКандидаты.Добавить(ИмяПоля);
		Если Не ПустаяСтрока(ИмяТаблицы) И Лев(НРег(ИмяПоля), СтрДлина(ИмяТаблицы)) = НРег(ИмяТаблицы) Тогда
			ИменаКандидаты.Добавить(Сред(ИмяПоля, СтрДлина(ИмяТаблицы) + 1));
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(ЗаголовокПоля) Тогда
		ИменаКандидаты.Добавить(ЗаголовокПоля);
	КонецЕсли;
	
	Коллекции = Новый Массив;
	Коллекции.Добавить(Метаданные.Справочники);
	Коллекции.Добавить(Метаданные.Документы);
	Коллекции.Добавить(Метаданные.Перечисления);
	Коллекции.Добавить(Метаданные.ПланыВидовХарактеристик);
	Коллекции.Добавить(Метаданные.ПланыСчетов);
	Коллекции.Добавить(Метаданные.ПланыВидовРасчета);
	Для Каждого ИмяКандидат Из ИменаКандидаты Цикл
		НормКандидат = НормализоватьИмяМетаданных(ИмяКандидат);
		Если ПустаяСтрока(НормКандидат) Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого КоллекцияМетаданных Из Коллекции Цикл
			Для Каждого ОбъектМетаданных Из КоллекцияМетаданных Цикл
				Если НРег(ОбъектМетаданных.Имя) = НормКандидат Тогда
					Возврат ОбъектМетаданных.ПолноеИмя();
				КонецЕсли;
				Если НРег(НормализоватьИмяМетаданных(ОбъектМетаданных.Синоним)) = НормКандидат Тогда
					Возврат ОбъектМетаданных.ПолноеИмя();
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Возврат "";
КонецФункции

Функция НормализоватьИмяМетаданных(Значение)
	Результат = НРег(Строка(Значение));
	Результат = СтрЗаменить(Результат, " ", "");
	Результат = СтрЗаменить(Результат, "_", "");
	Результат = СтрЗаменить(Результат, "-", "");
	Возврат Результат;
КонецФункции

Функция НормализоватьUUIDДляСсылки(Значение)
	Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		Возврат Значение;
	КонецЕсли;
	ТекстUUID = СокрЛП(Строка(Значение));
	ТекстUUID = СтрЗаменить(ТекстUUID, "{", "");
	ТекстUUID = СтрЗаменить(ТекстUUID, "}", "");
	ТекстUUID = СтрЗаменить(ТекстUUID, """", "");
	Попытка
		Возврат Новый УникальныйИдентификатор(ТекстUUID);
	Исключение
		ВызватьИсключение "Invalid task UUID: " + ТекстUUID;
	КонецПопытки;
КонецФункции

Функция ПоместитьСсылкуВоВременноеХранилище(ВидМетаданных, ИмяМетаданных, UUID) Экспорт
	Идентификатор = НормализоватьUUIDДляСсылки(UUID);
	Если НРег(ВидМетаданных) = "task" Тогда
		Ссылка = ПолучитьСсылкуЗадачи(ИмяМетаданных, Идентификатор);
	ИначеЕсли НРег(ВидМетаданных) = "catalog" Тогда
		Ссылка = Справочники[ИмяМетаданных].ПолучитьСсылку(Идентификатор);
	ИначеЕсли НРег(ВидМетаданных) = "document" Тогда
		Ссылка = Документы[ИмяМетаданных].ПолучитьСсылку(Идентификатор);
	Иначе
		ВызватьИсключение "Unsupported reference metadataKind: " + ВидМетаданных;
	КонецЕсли;
	Возврат ПоместитьВоВременноеХранилище(Ссылка);
КонецФункции

Функция ПоместитьФормуВыполненияЗадачиВоВременноеХранилище(ИмяМетаданных, UUID) Экспорт
	Описание = ПолучитьОписаниеФормыВыполненияЗадачи(ИмяМетаданных, UUID);
	// A TestManager can navigate a task reference through the native TestClient
	// protocol.  Unlike a temporary-storage payload this survives the boundary
	// between the manager and client sessions and lets the application choose its
	// registered execution form itself.
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ПолучитьСсылкуЗадачи(ИмяМетаданных, UUID));
	Возврат Новый Структура("formName,parametersAddress,parameters,navigationLink", Описание.ИмяФормы, ПоместитьВоВременноеХранилище(Описание.ПараметрыФормы), Описание.ПараметрыФормы, НавигационнаяСсылка);
КонецФункции

Функция ПолучитьОписаниеФормыВыполненияЗадачи(ИмяМетаданных, UUID)
	Если НРег(ИмяМетаданных) <> НРег("ЗадачаИсполнителя") Тогда
		ВызватьИсключение "Task execution form is supported only for TaskExecutor references";
	КонецЕсли;
	Задача = ПолучитьСсылкуЗадачи(ИмяМетаданных, UUID);
	// The bridge is compiled for configurations both with and without BSP.
	// Resolve the standard task API only at runtime in a database that provides it.
	Описание = Неопределено;
	Выполнить("Описание = БизнесПроцессыИЗадачиВызовСервера.ФормаВыполненияЗадачи(Задача);");
	Если Не Описание.Свойство("ИмяФормы") Или Не Описание.Свойство("ПараметрыФормы") Или ПустаяСтрока(Описание.ИмяФормы) Тогда
		ВызватьИсключение "Task has no special execution form";
	КонецЕсли;
	Возврат Описание;
КонецФункции

Функция ПолучитьСсылкуЗадачи(ИмяМетаданных, UUID) Экспорт
	// Коллекция менеджеров Задачи не поддерживает индексный доступ. Проверяем
	// имя по метаданным и вызываем менеджер динамически, как требует
	// платформенный API для универсального имени задачи.
	Если Метаданные.Задачи.Найти(ИмяМетаданных) = Неопределено Тогда
		ВызватьИсключение "Task metadata was not found: " + ИмяМетаданных;
	КонецЕсли;
	НормализованныйUUID = НормализоватьUUIDДляСсылки(UUID);
	Задача = Неопределено;
	Выполнить("Задача = Задачи." + ИмяМетаданных + ".ПолучитьСсылку(НормализованныйUUID);");
	Возврат Задача;
КонецФункции
